<a href="https://colab.research.google.com/github/marisbotero/sapiencia/blob/main/RFM.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PPROYECTO DISTRIAS

### LIBRER√çAS

In [1]:
import pandas as pd
import seaborn as sns

### LECTURA DEL DATASET

In [3]:
df = pd.read_excel('datos_distrias.xlsx')
df.head(2)

  NOMBRE_DOCUMENTO_MAESTRO       NOMBRE_CONSECUTIVO  ... ID_VENDEDOR  Columna1
0                  FACTURA  FACTURA ELECTRONICA DEV  ...        1856       NaN
1                  FACTURA  FACTURA ELECTRONICA DEV  ...        1856       NaN

[2 rows x 39 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222272 entries, 0 to 222271
Data columns (total 39 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   NOMBRE_DOCUMENTO_MAESTRO  222272 non-null  object
 1   NOMBRE_CONSECUTIVO        222272 non-null  object
 2   TIPO_DOCUMENTO            222272 non-null  object
 3   NUMERO_DOCUMENTO          222272 non-null  int64
 4   FECHA_DOCUMENTO           222272 non-null  datetime64[ns]
 5   FECHA_VENCIMIENTO         222272 non-null  datetime64[ns]
 6   IDENTIFICACION_TERCERO    222272 non-null  object
 7   NOMBRE_TERCERO            222272 non-null  object
 8   ID_CENTRO_COSTO           222272 non-null  int64
 9   NOMBRE_CENTRO_COSTO       222272 non-null  object
 10  NOMBRE_CLASIFICACION      222272 non-null  object
 11  ID_PRODUCTO_SERVICIO      222272 non-null  int64
 12  PRODUCTO_SERVICIO         222272 non-null  object
 13  CANTIDAD                  222272 non-null  float64
 14  VALOR_UNITARIO            222272 non-null  float64
 15  VALOR_TOTAL               222272 non-null  float64
 16  PORCENTAJE_DESCUENTO      222272 non-null  float64
 17  VALOR_DESCUENTO           222272 non-null  float64
 18  SUBTOTAL                  222272 non-null  float64
 19  IVA                       222272 non-null  float64
 20  TOTAL_NETO                222272 non-null  float64
 21  UTILIDAD                  222268 non-null  float64
 22  RENTABILIDAD              222268 non-null  float64
 23  COSTO                     222268 non-null  float64
 24  Columna2                  222268 non-null  float64
 25  CEDULA_VENDEDOR           222079 non-null  float64
 26  NOMBRE_VENDEDOR           222079 non-null  object
 27  FORMA_DE_PAGO             222272 non-null  object
 28  TIPO                      34288 non-null   object
 29  MARCA                     201064 non-null  object
 30  LINEA                     142269 non-null  object
 31  GRUPO                     216100 non-null  object
 32  CLASE                     150733 non-null  object
 33  NOMBRE_ESTABLECIMIENTO    45510 non-null   object
 34  ID_USUARIO_CREA           222272 non-null  int64
 35  USUARIO_CREA              222272 non-null  object
 36  ID_TERCERO                222272 non-null  int64
 37  ID_VENDEDOR               222272 non-null  int64
 38  Columna1                  0 non-null       float64
dtypes: datetime64[ns](2), float64(14), int64(6), object(17)
memory usage: 66.1+ MB

### LIMPIEZA E IMPUTACI√ìN DE DATOS

In [5]:
#Transformar tipo de variable
df['NUMERO_DOCUMENTO']=df['NUMERO_DOCUMENTO'].astype(str)
df['CEDULA_VENDEDOR']=df['CEDULA_VENDEDOR'].astype(str)
df['ID_CENTRO_COSTO']=df['ID_CENTRO_COSTO'].astype(str)
df['ID_PRODUCTO_SERVICIO']=df['ID_PRODUCTO_SERVICIO'].astype(str)
df['ID_USUARIO_CREA']=df['ID_USUARIO_CREA'].astype(str)
df['ID_TERCERO']=df['ID_TERCERO'].astype(str)
df['ID_VENDEDOR']=df['ID_VENDEDOR'].astype(str)

In [6]:
#Valores nulos
null_values=df.isnull().sum()/len(df) #Valores nulos
null_values[null_values>0]

UTILIDAD                  0.000018
RENTABILIDAD              0.000018
COSTO                     0.000018
Columna2                  0.000018
NOMBRE_VENDEDOR           0.000868
TIPO                      0.845739
MARCA                     0.095415
LINEA                     0.359933
GRUPO                     0.027768
CLASE                     0.321853
NOMBRE_ESTABLECIMIENTO    0.795251
Columna1                  1.000000
dtype: float64

In [7]:
#Imputaci√≥n de columnas
df = df.drop(['NOMBRE_ESTABLECIMIENTO','TIPO'], axis=1)

In [8]:
#Hay filas duplicadas?
l=[]
mask=df.duplicated()
for i in mask:
    if i==True:
        l.append(i)
print(len(l))

97

In [9]:
#Eliminar las filas dupliucadas
df = df.drop_duplicates()

In [10]:
#En la columna 'NOMBRE_DOCUMENTO_MAESTRO' se van a eliminar las filas correspondientes a notas cr√©dito, pues es una devoluci√≥n que no implica utilidades para la empresa
df = df.set_index('NOMBRE_DOCUMENTO_MAESTRO')
df = df.drop('NOTA CREDITO')
df.reset_index(level=0, inplace=True)

### EDA

In [11]:
df.describe()

            CANTIDAD  VALOR_UNITARIO  ...      Columna2  Columna1
count  212493.000000    2.124930e+05  ...  2.124930e+05       0.0
mean       35.022012    4.450882e+04  ...  9.090986e+04       NaN
std       311.370932    1.422137e+05  ...  3.980130e+05       NaN
min         0.000000    0.000000e+00  ... -1.108899e+07       NaN
25%         1.000000    4.500000e+03  ...  4.964845e+03       NaN
50%         5.000000    1.680000e+04  ...  1.679382e+04       NaN
75%        20.000000    3.605000e+04  ...  6.024000e+04       NaN
max    110000.000000    1.167893e+07  ...  4.871156e+07       NaN

[8 rows x 13 columns]

### AN√ÅLISIS RFM

El an√°lisis RFM permite determinar cu√°les son los mejores clientes teniendo en cuenta cu√°ndo realizaron su √∫ltima compra, con qu√© frecuencia lo hacen y cu√°nto se gastan. El RFM permite entender mejor c√≥mo funciona la base de clientes, conociendo su comportamiento.

Para aplicar la t√©cnica RFM hay que tener en cuenta las tres principales variables: Recency, Frequency, Monetary.

 - Recencia: ¬øCu√°ndo fue la √∫ltima vez que el cliente hizo una compra?
 - Frecuencia: define el n√∫mero de interacciones del cliente con la marca en un espacio determinado de tiempo.
 - Valor monetario: refleja la cantidad que se ha gastado el cliente en las compras hechas en ese espacio de tiempo.

#### RESENCIA

In [12]:
df['recency'] = pd.to_datetime('2021-11-13 08:26:00') - df['FECHA_VENCIMIENTO']

In [13]:
def recency(recency):
    res = str(recency).split(' ')[0]
    return(int(res))
df['recency'] = df['recency'].apply(recency)

In [14]:
df_recency = df[['NOMBRE_TERCERO','IDENTIFICACION_TERCERO','recency']]
df_recency = df_recency.drop_duplicates()

In [15]:
df_recency

                                           NOMBRE_TERCERO  ... recency
0       ECHEVERRI INVERSIONES CAMEL SOCIEDAD POR ACCIO...  ...     651
3                               GOMEZ MORA HELIODORO JOSE  ...     679
5                        DAVID ORDOSGOITIA LEONARDO JALIL  ...     680
8                                    COA GONZALEZ JACINTO  ...     679
9              ASOCIACION COLEGIO MILITAR ALMIRANTE COLON  ...     651
...                                                   ...  ...     ...
212474       CONSORCIO OBRAS VALLE INFERIOR DEL MAGDALENA  ...     132
212483                              CONSORCIO AQUA DE ORO  ...     263
212484       CONSORCIO OBRAS VALLE INFERIOR DEL MAGDALENA  ...     283
212489                              CONSORCIO AQUA DE ORO  ...     285
212491                        CONSORCIO VIRGEN DEL CARMEN  ...     261

[64184 rows x 3 columns]

#### FRECUENCIA

In [16]:
freq = df.groupby(['NOMBRE_TERCERO','IDENTIFICACION_TERCERO'])['FECHA_VENCIMIENTO'].count()
df_freq = pd.DataFrame(freq).reset_index()

In [17]:
df_freq

                                       NOMBRE_TERCERO  ... FECHA_VENCIMIENTO
0      \tEDIFICIO PORTO ALEGRE - PROPIEDAD HORIZONTAL  ...                 7
1                             ALCALA  HERNANDEZ PAOLA  ...                 2
2                                ALVAREZ  FERRER LUIS  ...                 3
3                               BARBOSA  OSUNA MARINA  ...                 4
4                              BELE√ëO RAMBAO GLORIA    ...                 2
...                                               ...  ...               ...
16588                         ZU√ëIGA HERRERA LADISLAO  ...                 2
16589                              ZU√ëIGA PEREZ ANGEL  ...                 7
16590                        ZU√ëIGA PE√ëATE CESARDAVID  ...                 1
16591                                   ZU√ëIGA RAMIRO  ...                 1
16592                          ZU√ëIGA SOLAR LUISMARIO  ...                 3

[16593 rows x 3 columns]

#### MONTO

In [18]:
monto = df.groupby(['NOMBRE_TERCERO','IDENTIFICACION_TERCERO'])['SUBTOTAL'].sum()
df_monto = pd.DataFrame(monto).reset_index()

In [19]:
df_monto

                                       NOMBRE_TERCERO  ...      SUBTOTAL
0      \tEDIFICIO PORTO ALEGRE - PROPIEDAD HORIZONTAL  ...  4.956520e+05
1                             ALCALA  HERNANDEZ PAOLA  ...  5.556092e+06
2                                ALVAREZ  FERRER LUIS  ...  5.436849e+06
3                               BARBOSA  OSUNA MARINA  ...  3.782276e+06
4                              BELE√ëO RAMBAO GLORIA    ...  1.681639e+06
...                                               ...  ...           ...
16588                         ZU√ëIGA HERRERA LADISLAO  ...  1.568450e+06
16589                              ZU√ëIGA PEREZ ANGEL  ...  4.602804e+05
16590                        ZU√ëIGA PE√ëATE CESARDAVID  ...  1.728300e+03
16591                                   ZU√ëIGA RAMIRO  ...  1.090714e+06
16592                          ZU√ëIGA SOLAR LUISMARIO  ...  1.027365e+05

[16593 rows x 3 columns]

#### DATASET RFM

In [20]:
finaldf = df_freq.merge(df_monto).merge(df_recency)

In [21]:
finaldf

                                       NOMBRE_TERCERO  ... recency
0      \tEDIFICIO PORTO ALEGRE - PROPIEDAD HORIZONTAL  ...     548
1                             ALCALA  HERNANDEZ PAOLA  ...     306
2                             ALCALA  HERNANDEZ PAOLA  ...     164
3                                ALVAREZ  FERRER LUIS  ...     366
4                                ALVAREZ  FERRER LUIS  ...     365
...                                               ...  ...     ...
64179                              ZU√ëIGA PEREZ ANGEL  ...     157
64180                              ZU√ëIGA PEREZ ANGEL  ...     144
64181                        ZU√ëIGA PE√ëATE CESARDAVID  ...     331
64182                                   ZU√ëIGA RAMIRO  ...     621
64183                          ZU√ëIGA SOLAR LUISMARIO  ...     169

[64184 rows x 5 columns]

In [22]:
finaldf.columns

Index(['NOMBRE_TERCERO', 'IDENTIFICACION_TERCERO', 'FECHA_VENCIMIENTO',
       'SUBTOTAL', 'recency'],
      dtype='object')

In [24]:
df_final = finaldf.rename(columns={'NOMBRE_TERCERO': 'Nombre_cliente', 'IDENTIFICACION_TERCERO': 'id_cliente','FECHA_VENCIMIENTO': 'Frecuencia',
       'SUBTOTAL': 'Monto', 'recency':'Recencia'})

In [25]:
df_final.head()

                                   Nombre_cliente  ... Recencia
0  \tEDIFICIO PORTO ALEGRE - PROPIEDAD HORIZONTAL  ...      548
1                         ALCALA  HERNANDEZ PAOLA  ...      306
2                         ALCALA  HERNANDEZ PAOLA  ...      164
3                            ALVAREZ  FERRER LUIS  ...      366
4                            ALVAREZ  FERRER LUIS  ...      365

[5 rows x 5 columns]

In [28]:
df_final['r_cuartil'] = pd.qcut(df_final['Recencia'], 4, ['1','2','3','4'])
df_final['f_cuartil'] = pd.qcut(df_final['Frecuencia'], 4, ['4','3','2','1'])
df_final['m_cuartil'] = pd.qcut(df_final['Monto'], 4, ['4','3','2','1'])

In [29]:
df_final.head()

                                   Nombre_cliente  ... m_cuartil
0  \tEDIFICIO PORTO ALEGRE - PROPIEDAD HORIZONTAL  ...         4
1                         ALCALA  HERNANDEZ PAOLA  ...         3
2                         ALCALA  HERNANDEZ PAOLA  ...         3
3                            ALVAREZ  FERRER LUIS  ...         3
4                            ALVAREZ  FERRER LUIS  ...         3

[5 rows x 8 columns]

In [30]:
df_final['RFM_Score'] = df_final['r_cuartil'].astype(str)+ df_final['f_cuartil'].astype(str) + df_final['m_cuartil'].astype(str)
df_final.head()

                                   Nombre_cliente  ... RFM_Score
0  \tEDIFICIO PORTO ALEGRE - PROPIEDAD HORIZONTAL  ...       444
1                         ALCALA  HERNANDEZ PAOLA  ...       243
2                         ALCALA  HERNANDEZ PAOLA  ...       243
3                            ALVAREZ  FERRER LUIS  ...       343
4                            ALVAREZ  FERRER LUIS  ...       343

[5 rows x 9 columns]

In [34]:
df_final.to_csv('df_final_rfm.csv', index=False)

In [33]:
# Filter out Top/Best cusotmers
df_final[df_final['RFM_Score']=='111'].sort_values('Monto', ascending=False).head()

              Nombre_cliente id_cliente  ...  m_cuartil  RFM_Score
12486  CONSORCIO AQUA DE ORO  901332047  ...          1        111
12482  CONSORCIO AQUA DE ORO  901332047  ...          1        111
12484  CONSORCIO AQUA DE ORO  901332047  ...          1        111
12483  CONSORCIO AQUA DE ORO  901332047  ...          1        111
12489  CONSORCIO AQUA DE ORO  901332047  ...          1        111

[5 rows x 9 columns]